app/controllers/movies_controller.rb

  def similar
      similar_movies = Movie.find_similar(params[:id])
      if similar_movies.nil?
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]